[
  {
    "id": 1,
    "courseId": 1,
    "name": "Gymnastics – Strength & Flexibility",
    "description": "Introductory class developing core strength, balance, and flexibility through basic gymnastic movements.",
    "price": 60.0,
    "currency": "PLN",
    "danceCategoryId": 1,
    "advancementLevelId": 1,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#FF5733"
  },
  {
    "id": 2,
    "courseId": 1,
    "name": "Gymnastics – Acro Basics",
    "description": "Beginner-friendly class focusing on rolls, handstands, and simple acrobatic techniques to build coordination.",
    "price": 60.0,
    "currency": "PLN",
    "danceCategoryId": 1,
    "advancementLevelId": 1,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#FF5733"
  },
  {
    "id": 3,
    "courseId": 2,
    "name": "Afro Dance",
    "description": "Introductory class exploring African-inspired rhythms, dynamic steps, and expressive movement combinations.",
    "price": 75.0,
    "currency": "PLN",
    "danceCategoryId": 2,
    "advancementLevelId": 2,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#C70039"
  },
  {
    "id": 4,
    "courseId": 3,
    "name": "Hip Hop – Groove & Flow",
    "description": "Introductory class focusing on rhythm, timing, and simple hip hop steps for beginners.",
    "price": 70.0,
    "currency": "PLN",
    "danceCategoryId": 3,
    "advancementLevelId": 3,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#FFC300"
  },
  {
    "id": 5,
    "courseId": 3,
    "name": "Hip Hop – Rhythm Basics",
    "description": "Class emphasizing groove, body control, and natural hip hop flow through easy-to-follow combinations.",
    "price": 45.0,
    "currency": "PLN",
    "danceCategoryId": 3,
    "advancementLevelId": 3,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#FFC300"
  },
  {
    "id": 6,
    "courseId": 3,
    "name": "Hip Hop – Choreo Level Up",
    "description": "Energetic session exploring dynamic hip hop choreography, performance skills, and self-expression.",
    "price": 75.0,
    "currency": "PLN",
    "danceCategoryId": 3,
    "advancementLevelId": 3,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#FFC300"
  },
  {
    "id": 7,
    "courseId": 4,
    "name": "Jazz – Technique and Isolations",
    "description": "Technical class focusing on isolations and expression.",
    "price": 65.0,
    "currency": "PLN",
    "danceCategoryId": 4,
    "advancementLevelId": 2,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#900C3F"
  },
  {
    "id": 8,
    "courseId": 4,
    "name": "Jazz – Stage Choreography",
    "description": "Learning choreography for stage performances.",
    "price": 70.0,
    "currency": "PLN",
    "danceCategoryId": 4,
    "advancementLevelId": 2,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#581845"
  },
  {
    "id": 9,
    "courseId": 5,
    "name": "Ballet – Barre Foundations",
    "description": "Classes focusing on posture, alignment, and basic positions at the barre.",
    "price": 58.0,
    "currency": "PLN",
    "danceCategoryId": 4,
    "advancementLevelId": 1,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#33A1FF"
  },
  {
    "id": 10,
    "courseId": 5,
    "name": "Ballet – Center Technique",
    "description": "Training in classical ballet movements, balance, and simple combinations in the center.",
    "price": 58.0,
    "currency": "PLN",
    "danceCategoryId": 4,
    "advancementLevelId": 1,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#1C6DD0"
  },
  {
    "id": 11,
    "courseId": null,
    "name": "Private Lesson – Ballet",
    "description": "Private ballet lesson tailored to the participant's level.",
    "price": 120.0,
    "currency": "PLN",
    "danceCategoryId": 2,
    "advancementLevelId": 2,
    "classType": "PRIVATE_CLASS",
    "scheduleTileColor": "#AA33CC"
  },
  {
    "id": 12,
    "courseId": null,
    "name": "Private Lesson – Salsa",
    "description": "Private salsa lesson – technique, styling, and improvisation.",
    "price": 110.0,
    "currency": "PLN",
    "danceCategoryId": 3,
    "advancementLevelId": 3,
    "classType": "PRIVATE_CLASS",
    "scheduleTileColor": "#CC8822"
  },
  {
    "id": 13,
    "courseId": null,
    "name": "Themed Dance Party – Latino Night",
    "description": "Latin dance night with a DJ and instructor.",
    "price": 45.0,
    "currency": "PLN",
    "danceCategoryId": 3,
    "advancementLevelId": null,
    "classType": "THEME_PARTY",
    "scheduleTileColor": "#FFD700"
  },
  {
    "id": 14,
    "courseId": null,
    "name": "Themed Party – Dance Fusion",
    "description": "Party-style class with elements of various dance styles.",
    "price": 50.0,
    "currency": "PLN",
    "danceCategoryId": null,
    "advancementLevelId": null,
    "classType": "THEME_PARTY",
    "scheduleTileColor": "#00CED1"
  },
  {
    "id": 15,
    "courseId": null,
    "name": "Private Lesson – Contemporary",
    "description": "Private session focusing on expression and technique in contemporary dance.",
    "price": 20,
    "currency": "PLN",
    "danceCategoryId": 4,
    "advancementLevelId": 1,
    "classType": "PRIVATE_CLASS",
    "scheduleTileColor": "#7B68EE"
  },
  {
    "id": 16,
    "courseId": 6,
    "name": "Freestyle Hip Hop – Individual Expression Workshop",
    "description": "An intensive freestyle hip-hop session designed to boost individual expression, rhythm interpretation, and improvisation. Participants explore musicality, body control, and dynamic changes in movement using beats typical for old school, new school, and street styles. The instructor provides creative movement challenges, encouraging dancers to develop their own unique flow and rhythm patterns. Perfect for dancers who already have solid foundations in hip-hop and want to learn how to connect emotion with movement and build confidence in solo performances.",
    "price": 15,
    "currency": "PLN",
    "danceCategoryId": 3,
    "advancementLevelId": 1,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#FFB347"
  },
  {
    "id": 17,
    "courseId": 6,
    "name": "Hip Hop Freestyle – Flow & Musicality Session",
    "description": "A freestyle hip-hop coaching session focused on developing personal flow, timing precision, and musical interpretation. The instructor tailors the exercises to the dancer’s level, working on freestyle structure, transitions, body isolation, and rhythm synchronization. The goal is to help the student move beyond memorized choreography and start ‘feeling’ the beat, expressing emotions naturally through hip-hop. Recommended for dancers aiming to perform or compete, as well as those who want to refine their own creative style.",
    "price": 15,
    "currency": "PLN",
    "danceCategoryId": 3,
    "advancementLevelId": 1,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#32CD32"
  },
  {
    "id": 18,
    "courseId": 7,
    "name": "Bachata Sensual – Couples Flow & Connection",
    "description": "A group class focused on the sensual and expressive side of bachata. Participants learn smooth body movement, partner connection, and musical interpretation with an emphasis on flow and rhythm synchronization. The instructor guides dancers through techniques such as body rolls, hip isolations, and gentle leading and following principles. Suitable for couples and singles willing to rotate partners during class. Perfect for those who want to feel more confident and connected while dancing to Latin rhythms.",
    "price": 20,
    "currency": "PLN",
    "danceCategoryId": 6,
    "advancementLevelId": 1,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#FF69B4"
  },
  {
    "id": 19,
    "courseId": 7,
    "name": "Bachata Technique & Styling – Group Session",
    "description": "A group bachata class focused on improving body coordination, rhythm precision, and individual styling. Participants practice partner work combinations, smooth transitions, and musical interpretation typical of both Dominican and sensual bachata. The instructor emphasizes elegance in movement, hip technique, and communication between partners through clear leading and following. The atmosphere is relaxed yet energetic, encouraging creativity, confidence, and enjoyment of dance in a supportive group setting.",
    "price": 20,
    "currency": "PLN",
    "danceCategoryId": 6,
    "advancementLevelId": 1,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#FFD700"
  },
  {
    "id": 20,
    "courseId": 8,
    "name": "Tango Argentina – Emotions, Connection & Flow",
    "description": "An elegant group class focusing on the essence of Argentine tango – connection, precision, and emotional expression. Participants will explore fundamental and intermediate tango techniques such as posture alignment, embrace connection, musical phrasing, and lead–follow dynamics. The instructor guides couples through characteristic tango movements including ochos, walks, and turns, emphasizing elegance, timing, and communication. Perfect for dancers who appreciate the depth and intimacy of tango and wish to experience the magic of storytelling through every step on the dance floor.",
    "price": 30,
    "currency": "PLN",
    "danceCategoryId": 7,
    "advancementLevelId": 2,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#DC143C"
  },
  {
    "id": 21,
    "courseId": 9,
    "name": "High Heels – Confidence, Balance & Stage Presence",
    "description": "A dynamic group class designed to help dancers move gracefully and confidently in high heels. Led by Karolina Gazela, this session focuses on body alignment, balance, and expressive choreography that highlights feminine energy and personal style. Participants learn how to combine technique with attitude, mastering elements like walking patterns, turns, poses, and floorwork transitions. Beyond choreography, the class develops posture, body awareness, and stage presence—empowering every dancer to feel bold, sensual, and in control both on and off the dance floor.",
    "price": 40,
    "currency": "PLN",
    "danceCategoryId": 8,
    "advancementLevelId": 2,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#C71585"
  },
  {
    "id": 22,
    "courseId": 10,
    "name": "Kizomba Fusion – Basics, Flow & Musicality",
    "description": "A group class focused on building a solid foundation in Kizomba Fusion, emphasizing rhythm, connection, and flow between partners. Participants learn characteristic steps and transitions while exploring how to move smoothly and musically to different tempos. The instructor introduces elements of traditional Kizomba mixed with Urban Kiz and Zouk, encouraging dancers to interpret the music creatively and maintain a relaxed yet precise leading-following dynamic.",
    "price": 35,
    "currency": "PLN",
    "danceCategoryId": 9,
    "advancementLevelId": 1,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#20B2AA"
  },
  {
    "id": 23,
    "courseId": 10,
    "name": "Kizomba Fusion – Connection, Expression & Creativity",
    "description": "An intermediate-level class exploring the essence of partner connection and expressive interpretation in Kizomba Fusion. The session blends techniques from Urban Kiz, Bachata, and Zouk, focusing on smooth transitions, controlled body movement, and emotional storytelling through dance. The instructor encourages participants to experiment with musical accents and creative styling, helping them find freedom within structure and deepen their connection with both music and partner.",
    "price": 35,
    "currency": "PLN",
    "danceCategoryId": 9,
    "advancementLevelId": 2,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#5F9EA0"
  },
  {
    "id": 24,
    "courseId": 10,
    "name": "Kizomba Fusion – Musical Interpretation & Styling",
    "description": "A creative group class where dancers focus on the artistic and musical aspects of Kizomba Fusion. Participants practice fluid transitions, body isolations, and expressive styling inspired by Urban Kiz and Brazilian Zouk. The instructor guides the group through exercises that enhance timing awareness, lead-follow communication, and personal movement aesthetics. Ideal for those who want to refine their technique and develop a unique, musical approach to Kizomba Fusion.",
    "price": 35,
    "currency": "PLN",
    "danceCategoryId": 9,
    "advancementLevelId": 3,
    "classType": "GROUP_CLASS",
    "scheduleTileColor": "#4682B4"
  }
]