[
  {
    "id": 1,
    "name": "ACRO GYMNASTICS",
    "description": "Classes cover the advanced basics of rhythmic gymnastics and acrobatics. They include stretching, acrobatic elements: side flips, handstands, front and back transitions, flips, cradles, jumps, pullovers, bridges, elbow flexibility, etc. The classes develop proper technique for performing difficult acrobatic elements and emphasize the beautiful posture necessary for many dance techniques, such as Modern, Jazz, and Classical. During classes, the following are required: leggings, clean, fresh socks, a bodysuit or tight blouse, and hair tied up. Instructor from the Polish Gymnastics Association section",
    "danceCategoryId": 1,
    "advancementLevelId": 1,
    "courseStatus": "ONGOING",
    "customPrice": 299.99
  },
  {
    "id": 2,
    "name": "AFRO DANCE",
    "description": "A dance characterized by energy, expression, rhythm, and connection to African culture. It requires bodywork and is characterized by a high degree of isolation.",
    "danceCategoryId": 2,
    "advancementLevelId": 2,
    "courseStatus": "SALE",
    "customPrice": 349.99
  },
  {
    "id": 3,
    "name": "HIP HOP STREET DANCE",
    "description": "Classes for children, teenagers, and adults of all skill levels teach the basics of hip-hop, funk, locking, old school, and house. They develop coordination and chest flexibility, and teach the basics of dance technique and movement in specific dance styles. During classes, dancers learn dance steps, techniques, and dance etudes or longer choreographies. The following is required for classes: comfortable clothing: leggings, tracksuit bottoms, short-sleeved top, changeable shoes with white or rubber soles (tennis shoes), a drink, and tied hair.",
    "danceCategoryId": 3,
    "advancementLevelId": 3,
    "courseStatus": "FINISHED",
    "customPrice": 399.99
  },
  {
    "id": 4,
    "name": "MODERN LYRICAL JAZZ JAZZ CONTEMPORARY",
    "description": "The foundation of jazz, contemporary, and modern dance techniques is classical (ballet). However, these styles lack the rigid movements that characterize ballet. They allow for a great deal of freedom of movement, expression, and improvisation. They incorporate a high degree of dynamic movement. Characteristic features of jazz and modern dance include isolating individual body parts, moving them in various planes (largely on the floor) and at varying tempos. These techniques effectively develop all muscle groups, improve overall body fitness, flexibility, fluidity, and elasticity, and teach the expression of emotions and feelings. These styles are sometimes enhanced with acrobatic elements.",
    "danceCategoryId": 4,
    "advancementLevelId": 2,
    "courseStatus": "SALE",
    "customPrice": 319.0
  },
  {
    "id": 5,
    "name": "BALLET",
    "description": "Basics of ballet technique, learning ballet choreography. Classics are the foundation of every dancer's skills. By participating in classes, children develop beautiful body posture, learn ballet technique, develop grace, learn body control, and proper movement. They also strengthen their muscles, allowing for high jumps and quick turns in body movements. Classical exercises stretch, improve flexibility, and strengthen muscles and tendons. During classes, the following is required: ballet skirt, bodysuit or tight blouse, leggings or tights, ballet shoes or socks, and hair tied up. Children participate in activities without their parents. Classes take place in a ballet hall with barre.",
    "danceCategoryId": 5,
    "advancementLevelId": 1,
    "courseStatus": "HIDDEN",
    "customPrice": 289.5
  },
  {
    "id": 6,
    "name": "FREE STYLE HIP HOP",
    "description": "Developing solo dance skills, focusing on your own style, and improvising movement to the movement tasks provided by the instructor. Every hip-hop dancer over the age of 11 should acquire freestyle skills to be able to perform it independently and express themselves through dance. Only when a dancer can independently reproduce the music through movement can they begin to understand hip-hop. Classes intended for dancers who already know the basics of Hip Hop. Comfortable clothing and footwear are required for classes, and hair must be tied up.",
    "danceCategoryId": 3,
    "advancementLevelId": 1,
    "courseStatus": "FINISHED",
    "customPrice": 300
  },
  {
    "id": 7,
    "name": "BACHATA",
    "description": "The music characteristic of this style gets your feet dancing from the very first notes. Our school offers solo classes for women and pair classes for couples and singles. Our bachata instructors are experienced and dedicated teachers who can reach even the most demanding students in a fun and engaging way.",
    "danceCategoryId": 6,
    "advancementLevelId": 1,
    "courseStatus": "FINISHED",
    "customPrice": 300
  },
  {
    "id": 8,
    "name": "TANGO ARGENTINA",
    "description": "Time for classics in their most elegant form! Tango is a dance full of emotion, passion, and character, allowing you to discover a unique bond between partners. Every step, every glance, and every musical accent create a unique story on the dance floor. Why is it worth trying tango? You will learn elegant and characteristic tango steps. You will develop the ability to lead and follow in dance. You will feel the intensity and emotions that this unique style brings. You will experience the extraordinary atmosphere that makes tango timeless. Enjoy dancing and let yourself be carried away by the magic of tango – this journey full of emotions will stay with you for a long time!",
    "danceCategoryId": 7,
    "advancementLevelId": 2,
    "courseStatus": "FINISHED",
    "customPrice": 280
  },
  {
    "id": 9,
    "name": "HIGH HEELS",
    "description": "Would you like to experience the magic of dancing in high heels and learn to express your power through movement? Karolina Gazela, known for her distinctive style and passion for dance, will guide you through the world of dancing in high heels. Whether you have experience dancing or are a beginner, our classes are for you. Karolina will introduce you to the world of high heels, showing you techniques, figures, and movements that will make you shine on the dance floor. It's not just about learning to dance; it's also an opportunity to express yourself, develop confidence, and enjoy movement. Classes with Karolina are an inspiring journey through the world of high heel dance, allowing you to discover the potential of your feminine expression. Join us for High Heels Classes with Karolina Gazela, and together we'll discover the potential of a dance style that will make you feel confident and sensual on any dance floor!",
    "danceCategoryId": 8,
    "advancementLevelId": 2,
    "courseStatus": "FINISHED",
    "customPrice": 350
  },
  {
    "id": 10,
    "name": "KIZOMBA FUSION",
    "description": "Kizomba Fusion is a variation of traditional Angolan Kizomba that combines elements of other dance styles, such as Urban Kiz, Brazilian Zouk, and Bachata. The essence of Kizomba remains paramount: basic steps, connection, and fluidity, but we've added a Fusion element, which offers a wealth of additional possibilities and freedom in the selection of figures, focusing on their artistic interpretation.",
    "danceCategoryId": 9,
    "advancementLevelId": 1,
    "courseStatus": "ONGOING",
    "customPrice": 350
  }
]